- **1.1 정형화된 데이터의 요소**
    - **데이터의 종류**
        
        <aside>
        💡 수치형데이터
        
        1. 풍속이나 지속시간 같은 연속형 데이터
        2. 사건의 발생 빈도 같은 이산데이터
        </aside>
        
        <aside>
        💡 범주형데이터
        
        1. TV스크린 종류(플라즈마, LCD, LED), 도시명(대전,부산,서울) 같이 범위가 정해진 값들을 갖는 경우
        2. 이진데이터 - 0과1, 예/아니오, 참/거짓과 같이 두 값 중 하나를 갖는 특수한 경우
        3. 순서형 데이터 - 평점(1,2,3,4,5)
        </aside>
        
- **1.2** **테이블 데이터**
    
    <aside>
    💡 테이블 데이터 : 데이터 분석에서 사용되는 객체의 형태
    
    - 기본적으로 각 레코드(사건)를 나타내는 행과, 피처(변수)를 나타내는 열로 이루어진 이차원 행렬을 의미하는 일반적인 용어
    </aside>
    
    <aside>
    💡 **1.2.2 : 테이블 형식이 아닌 구조**
    
    1. 시계열데이터
    2. 지도제작과 위치정보분석에 사용되는 공간데이터
        - 객체 : 어떤 객체( 하나의 실체로 인식되는것ex 주택)와 그것의 공간좌표(위치)가 데이터의 중심
            - 필드 : 공간을 나타내는 작은 단위들과 적당한 측정기준값( 일정 공간 상에 연속적으로 분포된 특정 계량값들 ex기온, 수온, 압력)에 중점을 둔다
    3. 그래프 데이터 : 물리적관계, 사회적관계, 추상적인 관계들을 표현하기 위해 사용
    </aside>
    
- **1.3 위치추정**
    - 데이터를 살펴보는 가장 기초적인 단계 : 각피처(변수)의 ‘대푯값’을 구하는 것. 이는 대부분의 값이 어디쯤에 위치하는지(중심경향성)을 나타내는 추정값이다.
    
    <aside>
    💡 용어정리
    
    1. 평균
    2. 가중평균
    3. 중간값
    4. 백분위수
    5. 가중중간값 : 데이터를 정렬한 후, 각 가중치 값을 위에서부터 더할때, 가중치 총합의 중간이 위치하는 데이터 값
    6. 절사평균 : 정해진 개수의 극단값을 제외한 나머지 값들의 평균
    7. 로버스트하다 : 극단값들에 민감하지 않다는 것을 의미한다.
    8. 특잇값 : 대부분의 값과 매우 다른 데이터의 값
    </aside>
    
    - **1.3.1 평균**
        - 평균
            - 가장 기본적인 위치추정 방법
            - 모든 값의 총합을 값의 개수로 나눈 값
            - X-bar
        - 절사평균
            - 값들을 크기순으로 정렬한 후, 양끝에서 일정 개수의 값들을 삭제한 뒤 남은 값들을 가지고 구한 평균
            - p개의 가장 크고, 작은 값을 제외한 후 평균계산
        - 가중평균
            - 각 데이터값 xi에 지정한 가중치 wi를 곱한 값들의 총합을 다시 가중치의 총합으로 나눈것
            
    - **1.3.2 중간값과 로버스트 추정**
        - 중간값
            - 데이터를 일렬로 정렬했을 때, 한가운데에 위치하는 값
            - 많은 데이터의 경우에 매우 민감한 평균보다는 중간값이 위치추정에 더 유리하다.
            - 특잇값에 로버스트하다.
        - 가중 중간값
            - 중간값과 마찬가지로 데이터를 정렬한 후, 어떤위치를 기준으로 상위데이터들의 가중치 합이 하위데이터들의 가중치 합과 동일한 위치의 값.
            - 특잇값에 로버스트하다.
        - 특잇값
            - 어떤 데이터 집합에서 다른 값들과 매우 멀리 떨어져 있는 값들
            
    - **1.3.3 예제 : 인구에 따른 살인 비율의 위치 추정**
        - [표1-2]는 미국 각 주의 인구와 살인 비율(2010 미국 인구조사 기준 인구 10만명당 연간 살인사건)을 보여준다
        - **[표1-2]**  첫 8행
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a802cbcc-1099-4d9d-8f43-6e23f1c6a8de/Untitled.png)
            
        - **인구의 평균, 절사평균, 중간값 계산**
            - 파이썬에서는 절사평균을 위해서 scipy.stats에 있는 trim_mean함수를 사용한다.
            - trim=0.1은 각끝에서 10%를 제외한다는 뜻
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/0445e983-3736-4e88-9344-d5d04dfb3f96/Untitled.png)
            
        - **미국 전체의 평균적인 살인율을 계산**하려면, 주마다 다른 인구를 고려하기 위해 가중평균이나 가중 중간값을 사용해야 한다.
            - 파이썬에서는 가중평균을 구하기 위해 numpy를 사용하며, 가중 중간값을 위해 wquantiles라는 특별한 패키지를 사용할 수 있다.
                
                ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/2c15914b-cec5-4faa-9e08-5b8aa8d0cc0a/Untitled.png)
                
- **1.4 변이추정**
    - 변이 : 데이터 값이 얼마나 밀집해 있는지 혹은 퍼져있는지를 나타내는 산포도를 나타낸다.
    - 변이를 측정하고, 줄이고, 실제변이와 랜덤을 구분하고, 실제 변이의 다양한 요인들을 알아보고, 변이가 있는 상황에서 결정을 내리는 등, 통계의 핵심에 변이가 있다.
    
    <aside>
    💡 용어정리
    
    - 편차 : 관측값과 위치추정값 사이의 차이
    - 분산 : 평균과의 편차를 제곱한 값들의 합을 n-1로 나눈값. n은 데이터의 개수
    - 표준편차 : 분산의 제곱근
    - 평균절대편차 : 평균과의 편차의 절댓값의 평균
    - 중간값의 중위절대편차(MAD) : 중간값과의 편차의 절댓값의 중간값
    - 범위 : 데이터의 최댓값과 최솟값의 차이
    - 순서통계량 : 최소에서 최대까지 정렬된 데이터 값에 따른 계량형
    - 백분위수: 어떤 값들의 P퍼센트가 이 값 혹은 더 작은 값을 갖고, (100-P)퍼센트가 이 값 혹은 더 큰 값을 갖도록 하는 값
    - 사분위범위(IQR) : 75번째 백분위수와 25번째 백분위수 사이의 차이
    </aside>
    
    - **1.4.1 표준편차와 관련 추정값들**
        - 가장 대표적으로 사용되는 변이 추정들은 관측 데이터와 위치 추정값 사이의 차이, 편차를 기본으로 함. 데이터가 중앙값을 주변으로 얼마나 퍼져있는지를 말해준다.
        - 분산, 표준편차, 평균절대편차 모두 특잇값과 극단값에 로버스트하지 않다. 분산과 표준편차는 제곱편차를 사용하기 때문에, 특히 특잇값에 민감하다.
        - 평균절대편차
            - 편차의 절댓값의 평균
        - 중위절대편차(MAD)
            - 중위절대편차 = 중간값(ㅣx1-mㅣ,ㅣx2-mㅣ,…, ㅣxn-mㅣ)
            - m=데이터의 중간값
            - 로버스트한 변이 추정값
    - **1.4.2 백분위수에 기초한 추정**
        - 순위 통계량 : 정렬(순위) 데이터를 나타내는 통계량
        - 백분위수 : 데이터에서 P번째 백분위수는 P퍼센트의 값이 그 값 혹은 그보다 작은 값을 갖고 (100 - P)퍼센트의 값이 그값 혹은 그보다 큰 값을 갖는 어떤 값을 의미한다.
            - 백분위수는 분수형태로 나타낸 분위수(quantile)과 근본적으로 같은 것이다. ( 0.8분위수는 80번째 백분위수와 같다)
        - 사분위범위(IQR)는 변이를 측정하는 가장 대표적인 방법으로, 25번째 백분위수와 75번째 백분위수의 차이를 보는 것이다.
    - **1.4.3 예제 : 주별 인구의 변이 추정**
        - [표1-3]는 미국 각 주의 인구와 살인 비율(2010 미국 인구조사 기준 인구 10만명당 연간 살인사건)을 보여준다
        - **[표1-3]**  첫 8행
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a802cbcc-1099-4d9d-8f43-6e23f1c6a8de/Untitled.png)
            
        - 팬더스 데이터 프레임은 표준편차와 분위수를 계산하는 메서드를 제공함. 분위수를 사용해 IQR을 쉽게 결정할 수 있다.
        - 표준편차, 사분위범위(IQR), 중위절대편차(MAD)계산
            - 파이썬에서는 MAD를 계산하기 위해 statsmodels 패키지의 strong.scale.mad함수를 이용.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/0dd5f6be-9aa1-45eb-b633-3ee0f1e526e6/Untitled.png)
            
- **1.5 데이터 분포 탐색하기**
    
    <aside>
    💡 용어정리
    
    - 상자그림 : 투키가 데이터의 분포를 시각화하기 위한 간단한 방법으로 소개한 그림
    - 도수분포표 : 어떤 구간interval(빈bin)에 해당하는 수치데이터의 값들의 빈도를 나타내는 기록
    - 히스토그램 : x축은 구간들을, y축은 빈도수를 나타내는 도수 테이블의 그림. 막대그래프를 히스토그램과 혼동하면 안됨.
    - 밀도그림 : 히스토그램을 부드러운 곡선으로 나타낸그림. 커널밀도추정을 주로 사용함.
    </aside>
    
    - **1.5.1 백분위수와 상자그림**
        - 데이터의 전체 분포를 알아보는 데에도 백분위수가 유용하다. 주로 사분위수나 십분위수를 공식적으로 사용한다. 특히 백분위수는 분포의 꼬리부분을 묘사하는데 제격이다.
        - [표1-4]는 주별 살인율의 백분위수를 보여준다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3e1e0868-a232-44c4-9d76-70ecf4d37980/Untitled.png)
            
            - 파이썬에서는 팬더스 데이터 프레임 메서드 quantile을 제공한다.
                
                ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/d1913934-4f61-4e62-9949-03f29c6a0a41/Untitled.png)
                
                - 중간값은 10만명당 4건의 살인이 있다고 알려준다.
        - 상자그림은 이 백분위 수를 이용해 데이터의 분산을 손쉽게 시각화 할 수 있다. [그림1-2]는 주별 인구분포를 나타내는 상자그림이다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/79ce9275-412e-42f1-b17f-aee654faca48/Untitled.png)
            
            - 이 상자그림에서 주별 인구의 중간값이 약 500만이고, 주 절반이 약 200만에서 700만사이이며, 인구수가 높은 이상치가 있음을 바로 알 수 있다.
            - 상자부분의 위쪽과 아래쪽은 각각 75%, 25% 백분위수를 나타낸다. 중간값은 상자안에 있는 굵은 수평선으로 표시한다.
            - 구레나룻처럼 위아래로 나있는 선이 바로 수염tail으로, 데이터 전체의 범위를 나타내주는 위아래 선들과 연결되어있다.
            - R과 matplotlib은 수염부분이 사분위 범위의 1.5배 이상 더 멀리 나가지 않도록한다.
            - 수염부분보다 더 바깥쪽에 위치한 데이터는 각자 하나의 점 또는 원(특잇값)으로 표시한다.
    - **1.5.2 도수분포표와 히스토그램**
        - 도수분포표 : 변수의 범위를 동일한 크기의 구간으로 나눈 다음, 각 구간마다 몇개의 변수값이 존재하는지를 보여주기 위해 사용된다.
        - [표1-5]는 주별인구의 도수분포표를 보여준다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/4b9d4285-128c-477c-bbe2-e51d02336d8f/Untitled.png)
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/737d23a7-88c7-4692-a90c-42f59c99245e/Untitled.png)
            
            - 인구가 가장 적은곳은 와이오밍주(563,626명), 인구가 가장 많은 곳은 캘리포니아주(37,253,956)이다.
            - 이를통해 범위가 36,690,330이라는 것을 알 수 있다.
            - 이를 균일한 크기로 나눠야 하는데, 10개의 구간으로 나눠보자. 10개의 동일한 구간으로 나누려면 각 구간의 크기는 3,669,033이 되어야한다.
            - **도수분포표**와 **백분위수** 모두 구간을 나눠서 데이터를 살펴보는 방법이다. 일반적으로 **사분위수와 십분위수**는 같은 수의 데이터가 포함되도록, 즉 서로 크기가 다르게 구간을 나누는 것이라고 할 수 있다. 반면에 **도수분포표**는 구간의 크기가 같도록, 즉 구간안에 다른 개수의 데이터가 오도록 한다고 볼 수 있다.
        - 히스토그램은 바로 이 도수분포표를 시각화하는 방법이다.
            - x축에는 구간들을 표시하고, y축에는 해당 구간별 데이터의 개수를 표시한다.
            - [표1-5]에 대한 히스토그램을 그리기 위해 팬더스에서는 DataFrame.plot.hist메서드를 사용한다. 구간의 개수를 정의하려면 키워드인수 bins를 사용한다.
                
                ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/24dc4b79-513b-4d68-83bb-bfae35caa45a/Untitled.png)
                
                - 보통 히스토그램은 다음과 같은 정보들을 담고있다.
                    - 그래프에 빈 구간이 있을 수 있다.
                    - 구간은 동일한 크기를 갖는다.
                    - 구간의 수나 크기는 사용자가 결정할 수 있다.
                    - 빈구간이 있지 않은 이상, 막대 사이는 공간 없이 서로 붙어있다.
    - **1.5.3 밀도 그림과 추정**
        - 밀도그림 : 데이터의 분포를 연속된 선으로 보여준다. 좀 더 부드러운 히스토그램이라고 볼 수 있다.
            - 커널밀도추정을 통해 데이터로부터 직접 계산한다.
        - [그림1-4]는 히스토그램에 겹쳐지게 밀도추정 결과를 표시한다.
            - 팬더스는 밀도그림을 생성하기 위해 density메서드를 제공한다. 밀도곡선의 부드러움을 제어하기 위해 bw_method인수를 사용한다.
            - 많은 플롯함수들은 플롯이 동일한 그래프에 추가될 수 있도록 선택적으로 축인수(ax)를 제공한다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/d1c1c40e-2900-4fb5-88d7-f34dde566b46/Untitled.png)
            
        - [그림1-3]의 히스토그램과 가장 큰 차이는 y축값의 단위이다. 밀도그림에서는 개수가 아닌 비율을 표시한다. 밀도곡선아래의 총 면적은 1이고, 구간의 개수대신 x축의 두 점 사이의 곡선 아래의 면적을 계산하며, 이는 두 점 사이에 있는 분포의 비율에 해당한다.
- **1.6 이진 데이터와 범주 데이터 탐색하기**
    - 범주형 데이터에서는 간단한 비율이나 퍼센트를 이용한다.
    
    <aside>
    💡 용어정리
    
    - 최빈값 : 데이터에서 가장 자주등장하는 범주 혹은 값
    - 기댓값 : 범주에 해당하는 어떤 수치가 있을 때, 범주의 출현확률에 따른 평균
    - 막대도표 : 각 범주의 빈도수 혹은 비율을 막대로 나타낸 그림
    - 파이그림 : 각 범주의 빈도수 혹은 비율을 원의 부채꼴 모양으로 나타낸 그림
    </aside>
    
    - [표1-6] 댈러스-포트워스 공항의 항공기 운행 지연 원인별 퍼센트 비율
        
        ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5191f2c3-f3e0-4b8d-85ed-b4b02f07e92a/Untitled.png)
        
    - 막대도표 : 어떤 범주형 자료를 보여줄때 주로 사용. x축위에 각 범주들을 놓고, y축은 각 범주에 해당하는 횟수나 비율을 표시한다.
    - [그림1-5]는 댈러스-포트워스 공항에서 매년 발생하는 항공기 지연의 원인과 그 횟수를 보여준다.
        
        ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b9b5b71e-dd24-4091-ab6e-5e7c9413cd40/Untitled.png)
        
        - 막대도표는 히스토그램과 매우 유사하다. 다만 막대도표에서 x축은 각 요인변수의 서로 다른 범주들을 나타내는 반면, 히스토그램의 x축은 수치적으로 나타낼 수 있는 하나의 변수의 값을 의미한다.
    - **1.6.2 기댓값**
        
        가중치가 해당 확률이 되는 가중평균
        
        1. 각 결괏값에서 발생확률을 곱한다.
        2. 이 값들을 모두 더한다.
        - 미래의 기댓값과 각 확률 가중치만큼을 모두 더한값이라고 할 수 있다.
- **1.7 상관관계**
    
    <aside>
    💡 용어정리
    
    - 상관계수 : 수치적 변수들 간에 어떤 관계가 있는지를 나타내기 위해 사용되는 측정량 ( -1에서 +1까지의 범위)
    - 상관행렬 : 행과 열이 변수들을 의미하는 표를 말하며, 각 셀은 그 행과 열에 해당하는 변수들의 간의 상관관계를 의미한다.
    - 산점도 : x축과 y축이 서로 다른 두개의 변수를 나타내는 도표
    </aside>
    
    - 상관계수 : 두 변수 사이의 상관관계를 항상 같은 척도에 놓고 추정
        - 변수 1과 변수 2 각각의 평균으로부터의 편차들을 서로 곱한 값들의 평균을 각 변수의 표준편차의 곱으로 나눠준다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/868e6d00-66c1-4ce6-b701-0439b20642d1/Untitled.png)
            
    - [표1-7]의 상관계수 행렬은 2012년 7월부터 2015년 6월까지 통신사 주식의 일간수익사이의 상관관계를 보여준다. 이 표에서 VZ와 T가 가장 높은 상관관계를 보인다. LVLT라는 인프라 설비 회사는 다른 회사들과 가장 낮은 상관관계를 보인다.
    - 행렬의 대각원소들은 모두 1(자기자신과 상관관계는 1이다)이라는 것, 그리고 대각원소 아래쪽은 위쪽과 같은 값을 갖는, 대칭행렬이라는 점을 기억하자.
    - [그림1-6]은 주요 상장 주식 펀드(ETF)들의 일간 수익 사이의 상관관계를 보여준다.
        
        ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/f5228db7-8552-4983-930a-0ec8ccaacb3c/Untitled.png)
        
        ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/133bffbe-02d6-4d72-b26e-2ce0b038dc5b/Untitled.png)
        
        - 타원모양의 방향은 두 변수가 양의 관계를 갖는지(타원이 오른쪽상단으로 기울어짐) 아니면 음의 관계를 갖는지 (타원이 왼쪽 상단으로 기울어짐)를 나타낸다.
        - 원의 색깔과 너비는 상관관계의 강도를 의미한다. 얇고 진할수록 더 강한 관계성을 나타낸다.
    - **1.7.1 산점도**
        - 두 변수 사이의 관계를 가장 기본적인 방법은 산점도를 그리는 것이다.
        - [그림1-7]은 AT&T와 버라이즌의 일간 수익 사이의 상관관계를 그림으로 나타낸 것이다. 팬더스의 scatter매서드를 사용한다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/63b08f8b-7fdb-4fb1-84fc-e8ed99336dba/Untitled.png)
            
            - 두 수익은 0주변에 모여 있지만 강한 양의 상관성을 보인다. 거의 매일 두 주식은 함께 오르고 함께 떨어진다.
- **1.8 두 개 이상의 변수 탐색하기**
    - 평균과 분산과 같이 익숙한 추정값들은 일변량 분석이다.
    - 상관분석은 두 변수(이변량분석)를 비교할 때 중요한 방법이다.
    - 이번절에서는 이에 관한 추정법과 도표를 살펴보고 셋 이상의 변수(다변량분석)를 다루는 법도 살펴본다.
    
    <aside>
    💡 용어정리
    
    - 분할표 : 두 가지 이상의 범주형 변수의 빈도수를 기록한 표
    - 육각형 구간 : 두 변수를 육각형 모양의 구간으로 나눈 그림
    - 등고 도표 : 지도상에 같은 높이의 지점을 등고선으로 나타내는 것 처럼, 두 변수의 밀도를 등고선으로 표시한 도표
    - 바이올린 도표 : 상자그림과 비슷하지만 밀도추정을 함께 보여준다
    </aside>
    
    - **1.8.1 육각형 구간과 등고선 (수치 변수 대 수치 변수 시각화)**
        - 워싱턴주에 위치한 킹 카운티의 주택 시설에 대한 과세 평가 금액 정보를 담고 있는 데이터 집합 kc_tax를 살펴본다. 데이터의 주요부분에 집중하기 위해, 아주 비싸거나, 너무 작은 혹은 너무 큰 주택들은 제거한다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5b06c0d7-439c-4462-9a59-0ffc0d3334c5/Untitled.png)
            
        - [그림1-8]의 육각형 구간 그림은 킹 카운티에 위치한 집들의 과세 평가액과 크기사이의 관계를 나타낸다. 마치 먹구름처럼 보이기도 하는 이 그림은, 점으로 표시하는 대신 기록값을 육각형 모양의 구간들로 나누고 각 구간에 포함된 기록값의 개수에 따라 색깔을 표시한다.
            - 이 도표에서 집의 크기와 과세평가금액이 양의 상관관계를 갖는 것을 쉽게 알 수 있다.
            - 파이썬에서는 팬더스 데이터 프레임 메서드인 hexbin을 사용하여 육각형구간도표를 쉽게 사용할 수 있다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/79cba546-f764-42d1-91f9-e13ccae51e91/Untitled.png)
            
        - [그림1-9]는 두 수치형 변수 사이의 관계를 시각화하기 위해 산점도 위에 등고선을 사용한다. 이 등고선은 이 두변수로 이루어진 지형에서 등고선을 의미한다.
            - 등고선 위의 점들은 밀도가 같다.
            - ‘꼭대기’쪽으로 갈수록 밀도는 높아진다.
            - 파이썬에서는 seaborn의 kdeplot함수를 이용해 등고선 도표를 생성한다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b0399f4e-b8d1-4176-9103-4313ffbcc48a/Untitled.png)
            
    - **1.8.2 범주형 변수 대 범주형 변수**
        - 분할표 : 두 범주형 변수를 요약하는 데 효과적인 방법으로, 범주별 빈도수를 기록한 표이다.
        - [표1-8]은 개인대출 등급과 대출 결과를 나타내는 분할표이다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/80030638-af17-4123-a929-768d05cccb97/Untitled.png)
            
            - 이 표는 빈도와 그 백분율을 보여준다.
            - 높은 등급의 대출일수록 낮은 등급에 비해 연체나 삭제 비율이 매우 낮다는 것을 알 수 있다.
            - 분할표를 통해 각 열의 빈도나 전체 백분율을 볼 수 있다.
            - 파이썬에서는 pivot_table 메서드를 이용해 피벗테이블을 만든다. aggfunc 인수를 사용하면 횟수 정보를 얻을 수 있다.
                
                ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/ef45272f-2f28-4d0d-9a14-84b7addcc43c/Untitled.png)
                
                - lambda x: len(x)는 해당 원소의 갯수를 말하는 것이다. 가령 1행 1열은 벡터 (A Charged Off)'가 1562개 반복되어 있기에 len(x)가 1562라는 것이다.
                - copy()는 원본을 복사하는 함수이다. 복사를 당하는 객체를 바꾸지 않고 새로운 하나를 만들어내는 것으로 생각하면 될 것이다.
                - div(df["All"],axis=0)는 행을 기준으로(axis=0) 해당 데이트를 df["All"]로 나눈다는 것이다. axis=1이라면 열로 나누는 것이다.
    - **1.8.3 범주형 변수 대 수치형 변수**
        - 상자형 그림은 범주형 변수에 따라 분류된 수치형 변수의 분포를 시각화하여 비교하는 간단한 방법이다.
            - [그림1-10]은 한 달 동안 항공기와 관련하여 일어난 비행 지연의 비율을 보여준다.
            - 팬더스의 boxplot메서드는 by인수를 사용하여 데이터 집합을 그룹별로 분할하고 각 그룹의 상자그림을 생성한다.
                
                ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/effcada5-7050-4ba9-81fa-34038ef39f2a/Untitled.png)
                
        - 바이올린 도표는 상자그림을 보완한 형태로, y축을 따라 밀도추정 결과를 동시에 시각화한다.
            - 바이올린 도표의 장점은 바로 상자그림에서는 보이지 않는 데이터의 분포를 볼 수 있다는 점이다.
            - 한편 상자그림은 데이터의 특잇값들을 좀 더 명확하게 보여준다.
            - 파이썬에서는 seaborn패키지의 vilolinplot 메서드로 바이올린 도표를 사용할 수 있다.
                
                ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/713cb7ce-99c7-462f-b67d-d9c8dcba6a09/Untitled.png)
                
                - **figure 와 ax 객체를 생성하는 방법**
                - #1. fig = plt.figure() : ax 없는 빈 figure 생성 (후에 ax를 추가해줘야함)
                - #2. fig, ax = plt.subplots() : 하나의 ax 만을 가지는 하나의 figure 생성
                - #3. fig, axes = plt.subplots(2,2) : 4개(2*2)이 ax들을 가지는 하나의 figure 생성
    - **1.8.4 다변수 시각화하기**
        - 조건화라는 개념을 통해 두 변수 비교용 도표(산점도, 육각형구간, 상자그림)을 더 여러변수를 비교하는 용도로 확장하여 활용할 수도 있다.
        - [그림1-12]에서는 우편번호별로 데이터를 묶어서 도식화했다.
            - 어떤 우편번호에서의 평가액이 다른 두군데보다 훨씬 높다는 것을 볼 수 있다.
            - 이러한 불균형이 [그림1-8]에서 관찰된 서로 다른 그룹들을 설명 가능하게 한다.
            
            ![Untitled](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/8fda6bf4-39ec-4795-b137-e07cfec0bd52/Untitled.png)
            
            1. 조건변수를 지정하려면 col 및 row 인수를 사용한다. 단일 조건 변수의 경우 col_wrap과 함께 col을 사용하여 패싯 그래프를 여러행으로 래핑한다. 
            2. map메서드는 다른 우편번호에 대한 원래 데이터 집합의 서브셋에 대해 hexbin함수를 호출한다. extent는 x축과 y축의 한계를 정의한다.
            
            —> 이 코드 설명 잘 해주신 블로그를 찾았답니다,,,ㅎ
            
            [https://whalerice.tistory.com/entry/1-8-%EB%91%90-%EA%B0%9C-%EC%9D%B4%EC%83%81%EC%9D%98-%EB%B3%80%EC%88%98-%ED%83%90%EC%83%89%ED%95%98%EA%B8%B0](https://whalerice.tistory.com/entry/1-8-%EB%91%90-%EA%B0%9C-%EC%9D%B4%EC%83%81%EC%9D%98-%EB%B3%80%EC%88%98-%ED%83%90%EC%83%89%ED%95%98%EA%B8%B0)
